; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-18)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 room6)
(at ball2 room6)
(at ball3 room6)
(at ball4 room6)
(at ball5 room6)
(at ball6 room6)
(at ball7 room6)
(at ball8 room6)
(at ball9 room6)
(at ball10 room6)
(at ball11 room6)
(at ball12 room6)
(at ball13 room6)
(at ball14 room6)
(at ball15 room6)
(at ball16 room6)
(at ball17 room6)
(at ball18 room6)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 0 of 18
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 0 of 18
3. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 0 of 18
4. (drop ball8 room6 right)
   deleted: (carry ball8 right)
   added: (at ball8 room6) (free right)
   goals met: 1 of 18
5. (drop ball9 room6 left)
   deleted: (carry ball9 left)
   added: (at ball9 room6) (free left)
   goals met: 2 of 18
6. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 2 of 18
7. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 2 of 18
8. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 2 of 18
9. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 2 of 18
10. (drop ball6 room6 right)
   deleted: (carry ball6 right)
   added: (at ball6 room6) (free right)
   goals met: 3 of 18
11. (drop ball7 room6 left)
   deleted: (carry ball7 left)
   added: (at ball7 room6) (free left)
   goals met: 4 of 18
12. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 4 of 18
13. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 4 of 18
14. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 4 of 18
15. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 4 of 18
16. (drop ball4 room6 right)
   deleted: (carry ball4 right)
   added: (at ball4 room6) (free right)
   goals met: 5 of 18
17. (drop ball5 room6 left)
   deleted: (carry ball5 left)
   added: (at ball5 room6) (free left)
   goals met: 6 of 18
18. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 6 of 18
19. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 6 of 18
20. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 6 of 18
21. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 6 of 18
22. (drop ball2 room6 right)
   deleted: (carry ball2 right)
   added: (at ball2 room6) (free right)
   goals met: 7 of 18
23. (drop ball3 room6 left)
   deleted: (carry ball3 left)
   added: (at ball3 room6) (free left)
   goals met: 8 of 18
24. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 8 of 18
25. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 8 of 18
26. (pick ball17 rooma right)
   deleted: (at ball17 rooma) (free right)
   added: (carry ball17 right)
   goals met: 8 of 18
27. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 8 of 18
28. (drop ball17 room6 right)
   deleted: (carry ball17 right)
   added: (at ball17 room6) (free right)
   goals met: 9 of 18
29. (drop ball18 room6 left)
   deleted: (carry ball18 left)
   added: (at ball18 room6) (free left)
   goals met: 10 of 18
30. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 10 of 18
31. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 10 of 18
32. (pick ball15 rooma right)
   deleted: (at ball15 rooma) (free right)
   added: (carry ball15 right)
   goals met: 10 of 18
33. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 10 of 18
34. (drop ball15 room6 right)
   deleted: (carry ball15 right)
   added: (at ball15 room6) (free right)
   goals met: 11 of 18
35. (drop ball16 room6 left)
   deleted: (carry ball16 left)
   added: (at ball16 room6) (free left)
   goals met: 12 of 18
36. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 12 of 18
37. (pick ball14 rooma left)
   deleted: (at ball14 rooma) (free left)
   added: (carry ball14 left)
   goals met: 12 of 18
38. (pick ball13 rooma right)
   deleted: (at ball13 rooma) (free right)
   added: (carry ball13 right)
   goals met: 12 of 18
39. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 12 of 18
40. (drop ball13 room6 right)
   deleted: (carry ball13 right)
   added: (at ball13 room6) (free right)
   goals met: 13 of 18
41. (drop ball14 room6 left)
   deleted: (carry ball14 left)
   added: (at ball14 room6) (free left)
   goals met: 14 of 18
42. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 14 of 18
43. (pick ball12 rooma left)
   deleted: (at ball12 rooma) (free left)
   added: (carry ball12 left)
   goals met: 14 of 18
44. (pick ball11 rooma right)
   deleted: (at ball11 rooma) (free right)
   added: (carry ball11 right)
   goals met: 14 of 18
45. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 14 of 18
46. (drop ball11 room6 right)
   deleted: (carry ball11 right)
   added: (at ball11 room6) (free right)
   goals met: 15 of 18
47. (drop ball12 room6 left)
   deleted: (carry ball12 left)
   added: (at ball12 room6) (free left)
   goals met: 16 of 18
48. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 16 of 18
49. (pick ball10 rooma left)
   deleted: (at ball10 rooma) (free left)
   added: (carry ball10 left)
   goals met: 16 of 18
50. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 16 of 18
51. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 16 of 18
52. (drop ball10 room6 left)
   deleted: (carry ball10 left)
   added: (at ball10 room6) (free left)
   goals met: 17 of 18
53. (drop ball1 room6 right)
   deleted: (carry ball1 right)
   added: (at ball1 room6) (free right)
   goals met: 18 of 18
